use HRDB;

-- 사원명, 생년월일, 전화번호, 부서, 직급, 입사일, 성별, 권한
INSERT INTO HRInformation (employeeName, birthday, phoneNum, department, employeeRank, joinDate, gender, authority) VALUES
('이서준', '1988-07-02', '010-1234-5678', 'MK', '대리', '2024-01-10', '남', 'admin'),
('박서연', '1995-04-17', '010-2345-6789', 'MN', '사원', '2024-02-15', '여', 'user'),
('김준우', '1991-09-25', '010-3456-7890', 'DV', '과장', '2024-03-20', '남', 'user'),
('최지아', '1986-12-08', '010-4567-8901', 'MK', '사원', '2024-04-18', '여', 'user'),
('이민재', '1993-02-28', '010-5678-9012', 'MN', '대리', '2024-05-22', '남', 'admin'),
('박지민', '1998-05-15', '010-6789-0123', 'DV', '사원', '2024-06-25', '여', 'user'),
('김예준', '1990-08-27', '010-7890-1234', 'MK', '과장', '2024-07-30', '남', 'user'),
('최시우', '1989-11-05', '010-8901-2345', 'MN', '사원', '2024-08-15', '여', 'user'),
('박세은', '1992-03-18', '010-9012-3456', 'DV', '대리', '2024-09-20', '남', 'admin'),
('이지원', '1997-06-02', '010-0123-4567', 'MK', '사원', '2024-10-10', '여', 'user');

select * from attendance;
select * from hrinformation;
select * from totalattendance;
select * from announcement;

-- 이서준의 출퇴근 내역
INSERT INTO attendance VALUES
('2024MK001', '2024-03-01', '08:00:00', '17:00:00',null), -- 월요일 출근, status null값 테스트
('2024MK001', '2024-03-02', '08:00:00', '17:00:00', 'attendance'), -- 화요일 출근
('2024MK001', '2024-03-03', '08:15:00', '17:00:00', 'lateness'),       -- 수요일 지각
('2024MK001', '2024-03-04', '08:00:00', '17:00:00', 'attendance'), -- 목요일 출근
('2024MK001', '2024-03-05', NULL, NULL, 'absence'),   -- 금요일 결근
('2024MK001', '2024-03-07', NULL, NULL, 'businesstrip'),-- 월요일 출장
('2024MK001', '2024-03-08', '08:00:00', '16:00:00', 'earlyLeave'), -- 화요일 조퇴
('2024MK001', '2024-03-09', '08:30:00', '17:00:00', 'attendance'), -- 수요일 출근
('2024MK001', '2024-03-10', '08:00:00', '17:00:00', 'attendance'), -- 목요일 출근
('2024MK001', '2024-03-11', '08:00:00', '17:00:00', 'attendance'), -- 금요일 출근
('2024MK001', '2024-03-14', '08:00:00', '17:00:00', 'attendance'), -- 월요일 출근
('2024MK001', '2024-03-15', '08:20:00', '17:00:00', 'lateness'),       -- 화요일 지각
('2024MK001', '2024-03-16', '08:00:00', '17:00:00', 'attendance'), -- 수요일 출근
('2024MK001', '2024-03-17', NULL, NULL, 'halfDayLeave'),    -- 목요일 반차
('2024MK001', '2024-03-18', '08:00:00', '17:00:00', 'attendance'), -- 금요일 출근
('2024MK001', '2024-03-21', '08:00:00', '17:00:00', 'attendance'), -- 월요일 출근
('2024MK001', '2024-03-22', '08:00:00', '17:00:00', 'attendance'), -- 화요일 출근
('2024MK001', '2024-03-23', '08:00:00', '17:00:00', 'attendance'), -- 수요일 출근
('2024MK001', '2024-03-24', '08:00:00', '17:00:00', 'attendance'), -- 목요일 출근
('2024MK001', '2024-03-25', NULL, NULL, 'businesstrip'),-- 금요일 출장
('2024MK001', '2024-03-28', '08:00:00', '17:00:00', 'attendance'), -- 월요일 출근
('2024MK001', '2024-03-29', '08:00:00', '17:00:00', 'attendance'), -- 화요일 출근
('2024MK001', '2024-03-30', '08:00:00', '12:00:00', 'halfDayLeave'), -- 수요일 반차
('2024MK001', '2024-03-31', '08:00:00', '17:00:00', 'attendance'); -- 목요일 출근



